In [1]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\miki_\anaconda3\lib\site-packages (3.0.5)
Requirement already satisfied: jdcal in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
q32018 = "../housingcsv/2018q3.xlsx"
df1 = pd.read_excel(q32018,engine='openpyxl')
refine1 = df1.drop(['Sales\n3Q 2017', 'Median\n3Q 2017', 'Median\nChange'], axis=1)
refine1= refine1.rename(columns={'Sales\n3Q 2018': 'Sales Q3 2018', 'Median\nQ3 2018': 'Median Q3 2018'})
refine1

               City          Suburb  Sales Q3 2018  Median\n3Q 2018
0          ADELAIDE        ADELAIDE            1.0         960000.0
1          ADELAIDE  NORTH ADELAIDE            9.0        1520000.0
2    ADELAIDE HILLS         ALDGATE            6.0         770000.0
3    ADELAIDE HILLS          ASHTON            1.0         600000.0
4    ADELAIDE HILLS    BASKET RANGE            NaN              NaN
..              ...             ...            ...              ...
474    WEST TORRENS       THEBARTON            4.0         586000.0
475    WEST TORRENS    TORRENSVILLE           12.0         620000.0
476    WEST TORRENS       UNDERDALE            6.0         655000.0
477    WEST TORRENS      WEST BEACH           14.0         904000.0
478    WEST TORRENS   WEST RICHMOND            1.0         490000.0

[479 rows x 4 columns]

In [4]:
q42018 = "../housingcsv/2018q4.xlsx"
df2 = pd.read_excel(q42018,engine='openpyxl')
refine2 = df2.drop(['Sales\n4Q 2017', 'Median\n4Q 2017', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2018':'Sales Q4 2018', 'Median\n4Q 2018': 'Median Q4 2018'})
refine2

               City          Suburb  Sales Q4 2018  Median Q4 2018
0          ADELAIDE        ADELAIDE            4.0       1660750.0
1          ADELAIDE  NORTH ADELAIDE            9.0       1395000.0
2    ADELAIDE HILLS         ALDGATE            9.0        747500.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            1.0        640000.0
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            5.0        642500.0
475    WEST TORRENS    TORRENSVILLE            7.0        525000.0
476    WEST TORRENS       UNDERDALE            5.0        660000.0
477    WEST TORRENS      WEST BEACH           13.0        751000.0
478    WEST TORRENS   WEST RICHMOND            2.0        500000.0

[479 rows x 4 columns]

In [5]:
q12019 = "../housingcsv/2019q1.xlsx"
df3 = pd.read_excel(q12019,engine='openpyxl')
refine3 = df3.drop(['Sales\n1Q 2018', 'Median\n1Q 2018', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2019':'Sales Q1 2019', 'Median\n1Q 2019': 'Median Q1 2019'})
refine3

               City          Suburb  Sales Q1 2019  Median Q1 2019
0          ADELAIDE        ADELAIDE            4.0       1002500.0
1          ADELAIDE  NORTH ADELAIDE           10.0        972000.0
2    ADELAIDE HILLS         ALDGATE           16.0        830000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            NaN             NaN
475    WEST TORRENS    TORRENSVILLE            7.0        588000.0
476    WEST TORRENS       UNDERDALE            5.0        700000.0
477    WEST TORRENS      WEST BEACH           16.0        852500.0
478    WEST TORRENS   WEST RICHMOND            4.0        510000.0

[479 rows x 4 columns]

In [6]:
q22019 = '../housingcsv/2019q2.xlsx'
df4 = pd.read_excel(q22019,engine='openpyxl')
refine4 = df4.drop(['Sales\n2Q 2018', 'Median\n2Q 2018', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2019': 'Sales Q2 2019', 'Median\n2Q 2019': 'Median Q2 2019'})
refine4

               City          Suburb  Sales Q2 2019  Median Q2 2019
0          ADELAIDE        ADELAIDE            4.0        677500.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1634250.0
2    ADELAIDE HILLS         ALDGATE           15.0        950000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            4.0        607500.0
475    WEST TORRENS    TORRENSVILLE           10.0        690000.0
476    WEST TORRENS       UNDERDALE            4.0        630000.0
477    WEST TORRENS      WEST BEACH           14.0        686000.0
478    WEST TORRENS   WEST RICHMOND            5.0        455000.0

[479 rows x 4 columns]

In [7]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2018,Median\n3Q 2018,Sales Q4 2018,Median Q4 2018,Sales Q1 2019,Median Q1 2019,Sales Q2 2019,Median Q2 2019
0,ADELAIDE,ADELAIDE,1.0,960000.0,4.0,1660750.0,4.0,1002500.0,4.0,677500.0
1,ADELAIDE,NORTH ADELAIDE,9.0,1520000.0,9.0,1395000.0,10.0,972000.0,6.0,1634250.0
2,ADELAIDE HILLS,ALDGATE,6.0,770000.0,9.0,747500.0,16.0,830000.0,15.0,950000.0
5,ADELAIDE HILLS,BELAIR,9.0,737000.0,19.0,670000.0,15.0,657500.0,17.0,541250.0
7,ADELAIDE HILLS,BRIDGEWATER,19.0,535000.0,15.0,470000.0,14.0,568750.0,20.0,483500.0
...,...,...,...,...,...,...,...,...,...,...
473,WEST TORRENS,RICHMOND,10.0,550000.0,12.0,580000.0,7.0,487000.0,9.0,574500.0
475,WEST TORRENS,TORRENSVILLE,12.0,620000.0,7.0,525000.0,7.0,588000.0,10.0,690000.0
476,WEST TORRENS,UNDERDALE,6.0,655000.0,5.0,660000.0,5.0,700000.0,4.0,630000.0
477,WEST TORRENS,WEST BEACH,14.0,904000.0,13.0,751000.0,16.0,852500.0,14.0,686000.0
478,WEST TORRENS,WEST RICHMOND,1.0,490000.0,2.0,500000.0,4.0,510000.0,5.0,455000.0

In [11]:
#Create column for value of propety prices by suburb for finanical year
new_col=[""]
final["y18_19_price"]=(final["Median\n3Q 2018"]+final["Median Q4 2018"]+final["Median Q1 2019"]+final["Median Q2 2019"])/4
final
y18_19_price=final
y18_19_price

#add new column to hold total sales for whole year
new_col=[""]
final["sales_18_19"]=(final["Sales Q3 2018"]+final["Sales Q4 2018"]+final["Sales Q1 2019"]+final["Sales Q2 2019"])
y19_20_price=final
y19_20_price

,City,Suburb,Sales Q3 2018,Median\n3Q 2018,Sales Q4 2018,Median Q4 2018,Sales Q1 2019,Median Q1 2019,Sales Q2 2019,Median Q2 2019,y18_19_price,sales_18_19
0,ADELAIDE,ADELAIDE,1.0,960000.0,4.0,1660750.0,4.0,1002500.0,4.0,677500.0,1075187.5,13.0
1,ADELAIDE,NORTH ADELAIDE,9.0,1520000.0,9.0,1395000.0,10.0,972000.0,6.0,1634250.0,1380312.5,34.0
2,ADELAIDE HILLS,ALDGATE,6.0,770000.0,9.0,747500.0,16.0,830000.0,15.0,950000.0,824375.0,46.0
5,ADELAIDE HILLS,BELAIR,9.0,737000.0,19.0,670000.0,15.0,657500.0,17.0,541250.0,651437.5,60.0
7,ADELAIDE HILLS,BRIDGEWATER,19.0,535000.0,15.0,470000.0,14.0,568750.0,20.0,483500.0,514312.5,68.0
...,...,...,...,...,...,...,...,...,...,...,...,...
473,WEST TORRENS,RICHMOND,10.0,550000.0,12.0,580000.0,7.0,487000.0,9.0,574500.0,547875.0,38.0
475,WEST TORRENS,TORRENSVILLE,12.0,620000.0,7.0,525000.0,7.0,588000.0,10.0,690000.0,605750.0,36.0
476,WEST TORRENS,UNDERDALE,6.0,655000.0,5.0,660000.0,5.0,700000.0,4.0,630000.0,661250.0,20.0
477,WEST TORRENS,WEST BEACH,14.0,904000.0,13.0,751000.0,16.0,852500.0,14.0,686000.0,798375.0,57.0
478,WEST TORRENS,WEST RICHMOND,1.0,490000.0,2.0,500000.0,4.0,510000.0,5.0,455000.0,488750.0,12.0

In [9]:
final.to_csv('y18_19_house.csv')

In [10]:
%store y18_19_price

Stored 'y18_19_price' (DataFrame)

In [12]:
# set up a new datafram to hold just suburb, sales count and median price for scatter plot
refined_Y1819=pd.DataFrame([y18_19_price.Suburb,y18_19_price.y18_19_price,y18_19_price.sales_18_19]).transpose()
refined_Y1819

             Suburb y18_19_price sales_18_19
0          ADELAIDE  1.07519e+06          13
1    NORTH ADELAIDE  1.38031e+06          34
2           ALDGATE       824375          46
5            BELAIR       651438          60
7       BRIDGEWATER       514312          68
..              ...          ...         ...
473        RICHMOND       547875          38
475    TORRENSVILLE       605750          36
476       UNDERDALE       661250          20
477      WEST BEACH       798375          57
478   WEST RICHMOND       488750          12

[358 rows x 3 columns]

In [14]:
# sort by median price and retrieve just 10
bottom_10_price=refined_Y1819.sort_values(by=['y18_19_price'],ascending=True)
bottom_10_price=bottom_10_price.head(10)

# format price
bottom_10_price["y18_19_price"]=bottom_10_price["y18_19_price"].map("{:,}".format)

print(f"Bottom 10 ranking in median price Suburbs\n{bottom_10_price}\n")

Bottom 10 ranking in median price Suburbs
                Suburb y18_19_price sales_18_19
289    ELIZABETH SOUTH    191,062.5          21
284    ELIZABETH DOWNS    191,250.0          74
287    ELIZABETH NORTH    196,875.0          43
280       DAVOREN PARK    198,000.0          75
288     ELIZABETH PARK    209,125.0          58
306  SMITHFIELD PLAINS    209,250.0          42
285     ELIZABETH EAST    222,187.5          60
305         SMITHFIELD    232,500.0          44
286    ELIZABETH GROVE    236,750.0          24
298         MUNNO PARA    241,250.0          51

In [15]:
# sort by median price and retrieve just 10
top_10_price=refined_Y1819.sort_values(by=['y18_19_price'],ascending=False)
top_10_price=top_10_price.head(10)

# format price
top_10_price["y18_19_price"]=top_10_price["y18_19_price"].map("{:,}".format)

print(f"Top 10 ranking in median price Suburbs\n{top_10_price}\n")

Top 10 ranking in median price Suburbs
             Suburb  y18_19_price sales_18_19
52         LEABROOK   1,814,125.0          10
447      UNLEY PARK   1,796,250.0          17
450        MEDINDIE   1,591,875.0          10
37          AULDANA   1,469,375.0          12
62   TOORAK GARDENS   1,465,000.0          30
63          TUSMORE   1,419,000.0          17
1    NORTH ADELAIDE   1,380,312.5          34
442         MALVERN   1,326,250.0          30
60       ST GEORGES   1,316,250.0          25
191        NETHERBY  1,278,381.25          19